IDEA StatiCa Open Model
DesignMemberInSubStructure Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 DesignMemberInSubStructure
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Model.DesignMemberInSubStructure
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class DesignMemberInSubStructure : OpenObject
Public Class DesignMemberInSubStructure
	Inherits OpenObject
public ref class DesignMemberInSubStructure : public OpenObject
The DesignMemberInSubStructure type exposes the following members.
Constructors
Name | Description
DesignMemberInSubStructure
Initializes a new instance of the DesignMemberInSubStructure class
Top
Properties
Name | Description
DesignMember
 Reference to DesignMember
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace